BusinessProcesses/ИА_БПНоситель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<BusinessProcess>
		<Properties>
			<Name>ИА_БПНоситель</Name>
			<Task>Task.ИА_ЗадачаПланаДействий</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИА_КартаМаршрутаБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПКартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_МаршрутЗадачБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_БПДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_Ответственный</Name>
					<Comment>ё</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_БПДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_БПИзмененРедактором</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_БПКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИА_Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИА_ПрикрепленныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПВидыПрикрепляемыхОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПВидыПрикрепляемыхОбъектов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИА_Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВнутр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Catalogs/ИА_БПМаршрутЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПМаршрутЗадач</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяКартаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПКартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВладельцаБПВЗадаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВладельцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/ИА_БПРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ИА_БПРеквизиты</Name>
			<Type>
				<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_ПланыДействий</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_БПДополнительныеЗначенияРеквизитов</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_ПротоколРС</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_ЗакрытиеЗаказаНаПриобретение</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Определения</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_ФинансовоеПланирование</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_УстановкаКвотыСтатистик</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
				<v8:Type>cfg:DocumentRef.удалить_ИА_НастройкаФП</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_ПроверочныйСписок</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
				<v8:Type>cfg:DocumentRef.ИА_Статистика</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Константы</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
				<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>20</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецРеквизита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УниКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

BusinessProcesses/ИА_БПНоситель/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
&НаСервере
Процедура ДеревоРеквизитов_ИзМД()
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   ИА_БПРеквизиты.Ссылка КАК Реквизит,
    |   ИА_БПРеквизиты.ЗначениеПоУмолчанию,
    |   ИА_БПРеквизиты.Порядок
    |ПОМЕСТИТЬ ВсеРеквизиты
    |ИЗ
    |   ПланВидовХарактеристик.ИА_БПРеквизиты КАК ИА_БПРеквизиты
    |ГДЕ
    |   ИА_БПРеквизиты.ВладелецРеквизита = &ВладелецРеквизита
    |   И НЕ ИА_БПРеквизиты.ПометкаУдаления
    |   И НЕ ИА_БПРеквизиты.ЭтоГруппа
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТЗ.Реквизит КАК Реквизит,
    |   ТЗ.Значение КАК Значение
    |ПОМЕСТИТЬ ТЗ
    |ИЗ
    |   &ТЗ КАК ТЗ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВсеРеквизиты.Реквизит КАК Реквизит,
    |   ЕСТЬNULL(ТЗ.Значение, ВсеРеквизиты.ЗначениеПоУмолчанию) КАК Значение,
    |   ЛОЖЬ КАК ЭтоГруппа,
    |   ВсеРеквизиты.ЗначениеПоУмолчанию,
    |   ВсеРеквизиты.Порядок КАК Порядок,
    |   ВсеРеквизиты.Реквизит.ТипЗначения КАК ТипЗначения
    |ИЗ
    |   ВсеРеквизиты КАК ВсеРеквизиты
    |       ЛЕВОЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
    |       ПО ВсеРеквизиты.Реквизит = ТЗ.Реквизит
    |
    |УПОРЯДОЧИТЬ ПО
    |   Порядок,
    |   Реквизит
    |ИТОГИ ПО
    |   Реквизит ТОЛЬКО ИЕРАРХИЯ
    |АВТОУПОРЯДОЧИВАНИЕ";
    
    Запрос.УстановитьПараметр("ВладелецРеквизита", Объект.ИА_МаршрутЗадачБП);
    Запрос.УстановитьПараметр("ТЗ", Объект.ИА_Реквизиты.Выгрузить());
    
    Результат = Запрос.Выполнить();
    
    Дерево = РеквизитФормыВЗначение("ДеревоРеквизитов");
    Дерево = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
    ЗаполнитьДанныеВВетке(Дерево);
    
    Дерево.Строки.Сортировать("Порядок, Реквизит", Истина);
    
    ЗначениеВРеквизитФормы(Дерево, "ДеревоРеквизитов");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеВВетке(ВеткаДерева, КэшДанных = Неопределено)
    Если КэшДанных = Неопределено Тогда
    	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ ПланВидовХарактеристик.ИА_БПРеквизиты
        | КАК Т ГДЕ Т.ВладелецРеквизита = &ВладелецРеквизита");
        Запрос.УстановитьПараметр("ВладелецРеквизита", Объект.ИА_МаршрутЗадачБП);
        ТЗ = Запрос.Выполнить().Выгрузить();
        Для каждого СтрокаТЗ Из ТЗ Цикл
        	ИА_БФС.Кэш_Вставить(КэшДанных, Новый Структура("Ссылка", СтрокаТЗ.Ссылка), СтрокаТЗ);
        КонецЦикла; 
    КонецЕсли; 
    
    Для каждого ПодчВетка Из ВеткаДерева.Строки Цикл
        ЗначениеКэша = ИА_БФС.Кэш_Получить(КэшДанных, Новый Структура("Ссылка", ПодчВетка.Реквизит));
        
        Если НЕ ЗначениеЗаполнено(ПодчВетка.Реквизит) Тогда
        	ПодчВетка.ЭтоГруппа = Истина;
        КонецЕсли; 
        
        Если ЗначениеКэша <> Неопределено Тогда
            ПодчВетка.ЭтоГруппа = ЗначениеКэша.ЭтоГруппа;
            ПодчВетка.Порядок = ЗначениеКэша.Порядок;
            ПодчВетка.ТипЗначения = ЗначениеКэша.ТипЗначения;
            Если ЗначениеКэша.ТипЗначения <> NULL Тогда
                ПодчВетка.Значение = ЗначениеКэша.ТипЗначения.ПривестиЗначение(ПодчВетка.Значение);
            КонецЕсли; 
        КонецЕсли; 
        ЗаполнитьДанныеВВетке(ПодчВетка, КэшДанных);
    КонецЦикла; 
КонецПроцедуры
 

&НаСервере
Функция ДеревоРеквизитов_ВМД()
    Дерево = РеквизитФормыВЗначение("ДеревоРеквизитов");
    Таб = Объект.ИА_Реквизиты.Выгрузить(Новый Массив);
    СохранитьВеткуВМД(Дерево, Таб);
    Возврат Таб;
КонецФункции

&НаКлиенте
Процедура РазвернутьДеревоРеквизитов()
	Для каждого СтрокаД Из ДеревоРеквизитов.ПолучитьЭлементы() Цикл
    	ИД = СтрокаД.ПолучитьИдентификатор();
        Элементы.ДеревоРеквизитов.Развернуть(ИД,Истина);
    КонецЦикла; 
    
    Элементы.страницаРеквизиты.Видимость = ДеревоРеквизитов.ПолучитьЭлементы().Количество()  > 0;
КонецПроцедуры
 

&НаСервере
Процедура СохранитьВеткуВМД(Дерево, Таб)
    Для каждого ПодчВетка Из Дерево.Строки Цикл
        Если НЕ ПодчВетка.ЭтоГруппа и ЗначениеЗаполнено(ПодчВетка.Реквизит) Тогда
            ЗаполнитьЗначенияСвойств(Таб.Добавить(), ПодчВетка);	
        КонецЕсли; 
        СохранитьВеткуВМД(ПодчВетка, Таб)
    КонецЦикла; 
КонецПроцедуры
 

&НаСервере
Функция СформироватьСписокНФ()
    М = Справочники.ИА_БПМаршрутЗадач.ПолучитьСписокМаршрутовПоОбъекту(Объект.ИА_Владелец);
    Результат = ИА_БФКС.Массив2СписокЗначений(М);
	Возврат Результат;
КонецФункции
 

//_____________________________________________________________

&НаСервере
Процедура УстановитьДоступность()
    Если Объект.Стартован Тогда
    	Элементы.ГруппаБП.ТолькоПросмотр = Истина;
        Элементы.ГруппаБПГлавная.ТолькоПросмотр = Истина;
        ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСтарт.Видимость = Ложь;
        ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаБПСтарт.Видимость = Ложь;
    КонецЕсли; 	
    
    Элементы.ВедущаяЗадача.Видимость = ЗначениеЗаполнено(Объект.ВедущаяЗадача);
КонецПроцедуры

&НаСервере
Процедура УстановитьНеизменяемыеПараметры()
    Настройки = ИА_БПС.ОбщиеНастройкиБП();
    
    Элементы.ФормаСформироватьПланВыполнения.Видимость = Настройки.ДлительностьЗадач;
КонецПроцедуры

 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ", Отказ) Тогда Возврат КонецЕсли; 
    
    УстановитьНеизменяемыеПараметры();
    
    ПутьКХранимымФайлам = ИА_БПС.Файлы_КаталогХранения();
    Если НЕ ЗначениеЗаполнено(ПутьКХранимымФайлам) Тогда
    	Элементы.страницаФайлы.Видимость = Ложь;        
        ИА_БФКС.СообщениеОбОшибке("В настройках программы не задан каталог хранения файлов, работа с файлами заблокирована!"); 
    Иначе
        ПутьКХранимымФайлам = ПутьКХранимымФайлам + ?(Прав(ПутьКХранимымФайлам, 1) = "\", "", "\") + "BP\";
    КонецЕсли; 
    
    
    
    ДеревоРеквизитов_ИзМД();
    УстановитьДоступность();
    ОбновитьКартуНаСервере();
    
    
    Настройки = ИА_БПС.ОбщиеНастройкиБП();
    Если НЕ Настройки.ДлительностьЗадач Тогда
    	Для каждого Эл Из Элементы Цикл
            Если  ИА_БФКС.РеквизитЕсть(Эл, "Имя")
                И ИА_БФКС.РеквизитЕсть(Эл, "Видимость")
                И Эл.Видимость
                И Найти(ВРЕГ(Эл.Имя), ВРЕГ("ИА_БППлановыеДатыВыполненияЗадач")) > 0
                Тогда
            	Эл.Видимость = Ложь;
            КонецЕсли; 
        КонецЦикла;  
    КонецЕсли; 
    
    Если НЕ Настройки.ЭтоАдмин Тогда
    	Элементы.ФормаЗавершитьНепосредственноБП.Видимость = Ложь;
    КонецЕсли; 
    
    Контекст = Новый Структура("Параметры, Объект, Форма", Параметры, Объект, ЭтаФорма);
    ИА_БПСПереопределяемый.Формы_БП_Форма_ПриСозданииНаСервере(Контекст);  
	
	Если не Объект.Ссылка.Пустая() ТОгда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_ЗадачаПланаДействийФайлы.Дата КАК Дата,
		               |	ИА_ЗадачаПланаДействийФайлы.Имя КАК Имя,
		               |	ИА_ЗадачаПланаДействийФайлы.Ссылка.Номер КАК Номер
		               |ИЗ
		               |	Задача.ИА_ЗадачаПланаДействий.Файлы КАК ИА_ЗадачаПланаДействийФайлы
		               |ГДЕ
		               |	ИА_ЗадачаПланаДействийФайлы.Ссылка.БизнесПроцесс = &БизнесПроцесс";
		Запрос.УстановитьПараметр("БизнесПроцесс",Объект.Ссылка );
		УстановитьПривилегированныйРежим(истина);
		тзф = запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(ложь);
		ЗначениеВРеквизитФормы(тзф,"ФайлыЗадач");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуНаСервере()
    Если Объект.Ссылка.Пустая() Тогда
        ТекущаяКарта = Справочники.ИА_БПКартыМаршрутов.ПолучитьКартуМаршрута(Объект.ИА_КартаМаршрутаБП);
    Иначе
        Обр = Обработки.ИА_БПМенеджер.Создать();
        Обр.Инициализировать(Объект.Ссылка);
        ТекущаяКарта = Обр.ПолучитьКартуМаршрута();
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
    ОбновитьКартуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
    Элементы.ГруппаБП.ТолькоПросмотр = Ложь;    
    Элементы.ГруппаБПГлавная.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    ДеревоРеквизитов_ИзМД();
    УстановитьДоступность();
    ОбновитьКартуНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьПланВыполненияНаСервере()
    Об = РеквизитФормыВЗначение("Объект");
    Результат = Об.СформироватьПланВыполнения();
    Возврат Результат.ПФ;
КонецФункции

&НаКлиенте
Процедура СформироватьПланВыполнения(Команда)
    ПФ = СформироватьПланВыполненияНаСервере();
    ПФ.ОтображатьСетку = Ложь;
    ПФ.ТолькоПросмотр = Истина;
    ПФ.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяКартаВыбор(Элемент)
	Если Элемент.ТекущийЭлемент <> Неопределено Тогда
		ИА_БПК.ПоказатьЗадачиПоТочке(Объект.Ссылка, Элемент.ТекущийЭлемент.Имя);
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
    ЭтаФорма.Записать();
    Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьКарты" И
		(Параметр = Объект.Ссылка
		ИЛИ Параметр = Объект.ИА_КартаМаршрутаБП)
		Тогда
        ЭтаФорма.Прочитать();
        ДеревоРеквизитов_ИзМД();
		ОбновитьКартуНаСервере();
        РазвернутьДеревоРеквизитов();
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьКартуНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ИА_КартаМаршрутаБППриИзменении(Элемент)
    УстановитьДоступность();
    ЗаполнитьМЗ();
    ДеревоРеквизитов_ИзМД();
    РазвернутьДеревоРеквизитов();
КонецПроцедуры


&НаКлиенте
Процедура ИА_МаршрутЗадачБППриИзменении(Элемент)
    ВыбратьКМПоУмолчанию();
    ДеревоРеквизитов_ИзМД();
    РазвернутьДеревоРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ВыбратьКМПоУмолчанию()
    Объект.ИА_КартаМаршрутаБП = Объект.ИА_МаршрутЗадачБП.ТекущаяКартаМаршрута;
    ОбновитьКартуНаСервере();
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьМЗ()
    Объект.ИА_МаршрутЗадачБП = Объект.ИА_КартаМаршрутаБП.МаршрутЗадач;
    ОбновитьКартуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    РазвернутьДеревоРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовПриАктивизацииЯчейки(Элемент)
    ТекСтрока = Элемент.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
    	Элементы.ДеревоРеквизитов.ПодчиненныеЭлементы.ДеревоРеквизитовЗначение.ТолькоПросмотр = ТекСтрока.ЭтоГруппа;
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    Таб = ДеревоРеквизитов_ВМД();
    ТекущийОбъект.ИА_Реквизиты.Загрузить(Таб);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    РазвернутьДеревоРеквизитов();
КонецПроцедуры


&НаКлиенте
Процедура ИА_МаршрутЗадачБПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    М = Новый Массив;
    Если ЗначениеЗаполнено(Объект.ИА_Владелец) Тогда
        СЗ = СформироватьСписокНФ();	
        Если СЗ.Количество() > 0 Тогда
            М.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", СЗ));
        КонецЕсли; 
    КонецЕсли; 
    Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(М);
КонецПроцедуры

//_____________________________________________________________
// БЛОК Работа с файлами

&НаКлиенте
Процедура ФайлыОткрыть(Команда)
    ТекСтрока = Элементы.ИА_Файлы.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Адрес = Файлы_ПолучитьФайлКакХранилище(ТекСтрока.ИмяВнутр);
        
        Если ЗначениеЗаполнено(Адрес) Тогда
            ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
            ИмяФайла = КаталогВременныхФайлов() + ТекСтрока.ИмяФайла;
            ДвоичныеДанные.Записать(ИмяФайла);
            ЗапуститьПриложение(ИмяФайла);
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИА_ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ФайлыОткрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДобавить(Команда)
    АдресВременногоХранилища = "";
    ВыбранноеИмя = "";
    Если ПоместитьФайл(АдресВременногоХранилища, ВыбранноеИмя, ВыбранноеИмя
        , Истина, ЭтаФорма.УникальныйИдентификатор) Тогда
        Модифицированность = Истина;
        НовСтрока = ТаблицаФайлов.Добавить();
        НовСтрока.Хранилище = АдресВременногоХранилища;
        НовСтрока.ИмяФайла  = ИА_БФКС.Файл_Имя(ВыбранноеИмя);
        НовСтрока.ИмяВнутр  = ИА_БФКС.СформироватьУИД() + "." + ИА_БФКС.Файл_Расширение(ВыбранноеИмя);
        НовСтрока.Дата      = ИА_БФКС.Файл_ВремяИзменения(ВыбранноеИмя);
        
        НовСтрТЧ = Объект.ИА_Файлы.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтрТЧ, НовСтрока);
    КонецЕсли;    
КонецПроцедуры


&НаСервере
Функция Файлы_ПолучитьФайлКакХранилище(ИмяВнутр)
    
    М = Объект.ИА_Файлы.НайтиСтроки(Новый Структура("ИмяВнутр", ИмяВнутр));
    Если М.Количество() <> 1 Тогда
    	ВызватьИсключение "Невозможно получить файл с ИмяВнутр=" + ИмяВнутр; 
    КонецЕсли; 
    
    Стр = М[0];
    
    М = ТаблицаФайлов.НайтиСтроки(Новый Структура("ИмяВнутр", ИмяВнутр));
    Если М.Количество() <> 0 Тогда
    	Адрес = М[0].Хранилище;
    Иначе
        ИмяФайлаНаСервере = Файлы_ПолучитьИмяФайлаНаСервере(ИмяВнутр);
        ДД = Новый ДвоичныеДанные(ИмяФайлаНаСервере);
        Адрес = ПоместитьВоВременноеХранилище(ДД, ЭтаФорма.УникальныйИдентификатор);
    КонецЕсли; 
    
    Возврат Адрес;
КонецФункции

&НаСервере
Функция Файлы_ПолучитьИмяФайлаНаСервере(ИмяВнутр, УИД = Неопределено)
    Если УИД = Неопределено Тогда
        Если Объект.Ссылка.Пустая() Тогда
            Возврат "";        
        КонецЕсли; 
    	УИД = Объект.Ссылка.УникальныйИдентификатор();
    КонецЕсли; 
    
    ПутьТекущий = ПутьКХранимымФайлам + УИД + "\";
    
    Если НЕ ИА_БФКС.Файл_Существует(ПутьТекущий) Тогда
        СоздатьКаталог(ПутьТекущий);
    КонецЕсли;
    Результат = ПутьТекущий + ИмяВнутр;
    Возврат Результат
КонецФункции
 
&НаКлиенте
Процедура ФайлыСохранить(Команда)
    ТекСтрока = Элементы.ИА_Файлы.ТекущиеДанные;
    Если ТекСтрока <> Неопределено Тогда
        Адрес = Файлы_ПолучитьФайлКакХранилище(ТекСтрока.ИмяВнутр);
        
        Если ЗначениеЗаполнено(Адрес) Тогда
            ИмяФайла = ТекСтрока.ИмяФайла;
            Расширение = ИА_БФКС.Файл_Расширение(ИмяФайла);
            Фильтр = "*" + Расширение + "|*" + Расширение + "|*.*|*.*";
            Если ИА_БФКС.Файл_ВыбратьФайл(ИмяФайла, РежимДиалогаВыбораФайла.Сохранение, Фильтр) Тогда
                ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
                ДвоичныеДанные.Записать(ИмяФайла);
            КонецЕсли; 
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
 
//_____________________________________________________________

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТекущийОбъект = БизнесПроцессы.ИА_БПНоситель.СоздатьБизнесПроцесс();
    #КОНЕЦЕСЛИ
     
    Если ТаблицаФайлов.Количество() > 0 Тогда
    	// Надо сохранить файлы
        
        Для каждого Стр Из ТаблицаФайлов Цикл
            ИмяФайлаВХранилище = Файлы_ПолучитьИмяФайлаНаСервере(Стр.ИмяВнутр, ТекущийОбъект.Ссылка.УникальныйИдентификатор());
            ДД = ПолучитьИзВременногоХранилища(Стр.Хранилище);
        	ДД.Записать(ИмяФайлаВХранилище);
        КонецЦикла; 
        
        ТаблицаФайлов.Очистить();
    КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ДеревоРеквизитовЗначениеПриИзменении(Элемент)
    Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура БПСтарт(Команда)
    Если Модифицированность
        ИЛИ Объект.Ссылка.Пустая()
        ИЛИ (Объект.ИА_Реквизиты.Количество() = 0 И ДеревоРеквизитов.ПолучитьЭлементы().Количество() > 0)
        Тогда
    	ЭтаФорма.Записать();
    КонецЕсли; 
    ЭтаФорма.Записать(Новый Структура("Старт", Истина) );
КонецПроцедуры


&НаСервере
Процедура ЗавершитьНепосредственноБПНаСервере()
    БизнесПроцессы.ИА_БПНоситель.ЗавершитьБП(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьНепосредственноБП(Команда)
    Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
        ЭтаФорма.Записать();
    КонецЕсли; 
    
    ПоказатьВопрос(
    Новый ОписаниеОповещения("ЗавершитьНепосредственноБПЗавершение", ЭтаФорма)
    , "Завершить непосредственно БП ?"
    , РежимДиалогаВопрос.ОКОтмена); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьНепосредственноБПЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
        ЗавершитьНепосредственноБПНаСервере();
        ЭтаФорма.Прочитать();
        ОбновитьКартуНаСервере();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыЗадачОткрыть(Команда)
	Если Элементы.ФайлыЗадач.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма,);
		НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#Иначе
		ОткрытьФайлЗавершение(Неопределено);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗавершение(ДополнительныеПараметры) Экспорт
	тд = Элементы.ФайлыЗадач.ТекущиеДанные;
    имяФайла = тд.Имя;
	АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(имяФайла, тд.Номер);
	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		врИмяФайла = КаталогВременныхФайлов() + имяФайла;
		#Если ВебКлиент Тогда
			ПолучитьФайл(АдресВременногоХранилища,врИмяФайла, истина);
		#Иначе
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
			ДвоичныеДанные.Записать(врИмяФайла);
			ЗапуститьПриложение(врИмяФайла);
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоместитьТекущийФайлВБуфер(ВыбранноеИмя,НомерЗ)
	
	КаталогХранения	= ПолучитьПолноеИмяФайла(ВыбранноеИмя,НомерЗ); 
	ФайлДляПередачи = Новый ДвоичныеДанные(КаталогХранения);
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ФайлДляПередачи, УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;
	
КонецФункции

&НаСервере
Функция ПолучитьПолноеИмяФайла(ВыбранноеИмя,НомерЗ)
	
	КаталогХранения = Константы.ИА_КаталогХраненияФайлов.Получить();
	КаталогХранения = КаталогХранения + СОКРЛП(НомерЗ) + "\";
	
	КаталогХранения = КаталогХранения + ВыбранноеИмя;
	
	Возврат КаталогХранения;
	
КонецФункции


&НаКлиенте
Процедура ФайлыЗадачСохранить(Команда)
	Если Элементы.ФайлыЗадач.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	#Если ВебКлиент Тогда
	    Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма);
	    НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#Иначе
		СохранитьФайлЗавершение(Неопределено);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗавершение(ДополнительныеПараметры) Экспорт
	тд = Элементы.ФайлыЗадач.ТекущиеДанные;
	
    Режим = РежимДиалогаВыбораФайла.Сохранение;	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Элементы.ФайлыЗадач.ТекущиеДанные.Имя;
	ДиалогОткрытияФайла.Заголовок = "Сохранение файла";
	Расширение = Сред(тд.Имя,Найти(тд.Имя, ".")+1);
	Фильтр = "(*."+ Расширение +")|*."+Расширение+"";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Расширение = Расширение;	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ВыбранныйКаталог = Новый Файл(ДиалогОткрытияФайла.Каталог);
		
		
		АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(тд.Имя, тд.Номер);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		
		Попытка
			ДвоичныеДанные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
